dggduu/example-esp32s3-echomouth/who_human_face_detection.cpp
#include "who_human_face_detection.hpp"
#include "dl_image.hpp"
#include "esp32_s3_szp.h"
#include "esp_camera.h"
#include "esp_log.h"
#include "human_face_detect_mnp01.hpp"
#include "human_face_detect_msr01.hpp"
#include "who_ai_utils.hpp"

#include "esp_cpu.h"

static const char *TAG = "human_face_detection";

#include "freertos/FreeRTOS.h"

static QueueHandle_t xQueueLCDFrame = NULL;
static QueueHandle_t xQueueAIFrame = NULL;

static bool gEvent = true;
static bool gReturnFB = true;

// AI处理任务
static void task_process_ai(void *arg) {
  camera_fb_t *frame = NULL;
  HumanFaceDetectMSR01 detector(0.3F, 0.3F, 10, 0.3F);
  HumanFaceDetectMNP01 detector2(0.4F, 0.3F, 10);

  while (true) {
    // vTaskDelay(5000 / portTICK_PERIOD_MS);
    if (gEvent) {
      // uint32_t start_cycles =
      //     esp_cpu_get_cycle_count(); // 获取开始时的 CPU 周期
      // int64_t start_time = esp_timer_get_time();

      if (xQueueReceive(xQueueAIFrame, &frame, portMAX_DELAY)) {
        std::list<dl::detect::result_t> &detect_candidates = detector.infer(
            (uint16_t *)frame->buf, {(int)frame->height, (int)frame->width, 3});
        std::list<dl::detect::result_t> &detect_results = detector2.infer(
            (uint16_t *)frame->buf, {(int)frame->height, (int)frame->width, 3},
            detect_candidates);

        if (detect_results.size() > 0) {
          draw_detection_result((uint16_t *)frame->buf, frame->height,
                                frame->width, detect_results);
          print_detection_result(detect_results);
        }
      }

      // uint32_t end_cycles = esp_cpu_get_cycle_count();
      // int64_t end_time = esp_timer_get_time();

      // uint32_t total_cycles = end_cycles - start_cycles;
      // float duration_ms = (end_time - start_time) / 1000.0f;

      // // 打印推理性能
      // ESP_LOGI(TAG, "Inference Performance: Time: %.2f ms | CPU Cycles: %u",
      //          duration_ms, total_cycles);

      if (xQueueLCDFrame) {
        xQueueSend(xQueueLCDFrame, &frame, portMAX_DELAY);
      } else if (gReturnFB) {
        esp_camera_fb_return(frame);
      } else {
        free(frame);
      }
    }
  }
}

// lcd处理任务
static void task_process_lcd(void *arg) {
  camera_fb_t *frame = NULL;

  while (true) {
    if (xQueueReceive(xQueueLCDFrame, &frame, portMAX_DELAY)) {
      lcd_draw_bitmap(0, 0, frame->width, frame->height,
                      (uint16_t *)frame->buf);
      esp_camera_fb_return(frame);
    }
  }
}

// 摄像头处理任务
static void task_process_camera(void *arg) {
  while (true) {
    camera_fb_t *frame = esp_camera_fb_get();
    if (frame)
      xQueueSend(xQueueAIFrame, &frame, portMAX_DELAY);
  }
}

// 人脸检测
void app_camera_ai_lcd(void) {
  xQueueLCDFrame = xQueueCreate(2, sizeof(camera_fb_t *));
  xQueueAIFrame = xQueueCreate(2, sizeof(camera_fb_t *));

  xTaskCreatePinnedToCore(task_process_camera, "task_process_camera", 3 * 1024,
                          NULL, 5, NULL, 1);
  xTaskCreatePinnedToCore(task_process_lcd, "task_process_lcd", 4 * 1024, NULL,
                          5, NULL, 0);
  xTaskCreatePinnedToCore(task_process_ai, "task_process_ai", 4 * 1024, NULL, 5,
                          NULL, 0);
}
